[NoCoverage] BlockStatement
controllers/Question.js:5:46
 const {firebase}= require('../config')
 const firestore = getFirestore(firebase);
 
-const getMaxquestion = async (userId, Part)=>{
-    const myCollection = collection(firestore, 'Users');
-    const docRef = doc(myCollection, userId);
-    try{
-    const documentSnapshot = await getDoc(docRef);
-  
-  if (documentSnapshot.exists()) {
-    if(Part == 'ListenPart1'||Part=='L1'){
-    const data = documentSnapshot.data().MaxQuestion?.L1 || 0;
-    return data;
-    }
-  } else {
-   return 0;
-  }
-    }
-    catch(e){
-        console.log("getMaxquestion "+e)
-    }
-}
+const getMaxquestion = async (userId, Part)=>{}
 const getQuestion = async (req,res)=>{
     const myCollection = collection(firestore, req.params.Part);

[NoCoverage] BlockStatement
controllers/Question.js:8:8
 const getMaxquestion = async (userId, Part)=>{
     const myCollection = collection(firestore, 'Users');
     const docRef = doc(myCollection, userId);
-    try{
-    const documentSnapshot = await getDoc(docRef);
-  
-  if (documentSnapshot.exists()) {
-    if(Part == 'ListenPart1'||Part=='L1'){
-    const data = documentSnapshot.data().MaxQuestion?.L1 || 0;
-    return data;
-    }
-  } else {
-   return 0;
-  }
-    }
+    try{}
     catch(e){
         console.log("getMaxquestion "+e)

[NoCoverage] ConditionalExpression
controllers/Question.js:11:7
     try{
     const documentSnapshot = await getDoc(docRef);
   
-  if (documentSnapshot.exists()) {
+  if (false) {
     if(Part == 'ListenPart1'||Part=='L1'){
     const data = documentSnapshot.data().MaxQuestion?.L1 || 0;

[NoCoverage] ConditionalExpression
controllers/Question.js:11:7
     try{
     const documentSnapshot = await getDoc(docRef);
   
-  if (documentSnapshot.exists()) {
+  if (true) {
     if(Part == 'ListenPart1'||Part=='L1'){
     const data = documentSnapshot.data().MaxQuestion?.L1 || 0;

[NoCoverage] LogicalOperator
controllers/Question.js:12:8
     const documentSnapshot = await getDoc(docRef);
   
   if (documentSnapshot.exists()) {
-    if(Part == 'ListenPart1'||Part=='L1'){
+    if(Part == 'ListenPart1' && Part == 'L1'){
     const data = documentSnapshot.data().MaxQuestion?.L1 || 0;
     return data;

[NoCoverage] EqualityOperator
controllers/Question.js:12:31
     const documentSnapshot = await getDoc(docRef);
   
   if (documentSnapshot.exists()) {
-    if(Part == 'ListenPart1'||Part=='L1'){
+    if(Part == 'ListenPart1'||Part != 'L1'){
     const data = documentSnapshot.data().MaxQuestion?.L1 || 0;
     return data;

[NoCoverage] ConditionalExpression
controllers/Question.js:13:18
   
   if (documentSnapshot.exists()) {
     if(Part == 'ListenPart1'||Part=='L1'){
-    const data = documentSnapshot.data().MaxQuestion?.L1 || 0;
+    const data = false;
     return data;
     }

[NoCoverage] LogicalOperator
controllers/Question.js:13:18
   
   if (documentSnapshot.exists()) {
     if(Part == 'ListenPart1'||Part=='L1'){
-    const data = documentSnapshot.data().MaxQuestion?.L1 || 0;
+    const data = documentSnapshot.data().MaxQuestion?.L1 && 0;
     return data;
     }

[NoCoverage] BlockStatement
controllers/Question.js:16:10
     const data = documentSnapshot.data().MaxQuestion?.L1 || 0;
     return data;
     }
-  } else {
-   return 0;
-  }
+  } else {}
     }
     catch(e){

[NoCoverage] BlockStatement
controllers/Question.js:20:13
    return 0;
   }
     }
-    catch(e){
-        console.log("getMaxquestion "+e)
-    }
+    catch(e){}
 }
 const getQuestion = async (req,res)=>{

[NoCoverage] BlockStatement
controllers/Question.js:26:9
 }
 const getQuestion = async (req,res)=>{
     const myCollection = collection(firestore, req.params.Part);
-    try {
-      let max = 0;
-      await getMaxquestion(req.params.userId, req.params.Part).then((item) => {
-        max = item;
-      })
-      const num = parseInt(req.params.number)+parseInt(max)
-      console.log(num)
-      const queryConstraints = [where("Order", ">", max),where("Order", "<=", num)];
-      const q = query(
-        myCollection,
-        ...queryConstraints
-      );
-      const querySnapshot = await getDocs(q);
-      // const list = querySnapshot.docs.map((doc) => doc.data());
-      const list = querySnapshot.docs.map((doc) => {
-        const data = doc.data();
-        const docId = doc.id;
-        return { ...data, Id: docId };
-      });
-      res.json({ success: true, Questions: list });
-    } catch (e) {
+    try {} catch (e) {
       res.json({
         success: false,

[NoCoverage] BlockStatement
controllers/Question.js:28:79
     const myCollection = collection(firestore, req.params.Part);
     try {
       let max = 0;
-      await getMaxquestion(req.params.userId, req.params.Part).then((item) => {
-        max = item;
-      })
+      await getMaxquestion(req.params.userId, req.params.Part).then((item) => {})
       const num = parseInt(req.params.number)+parseInt(max)
       console.log(num)

[NoCoverage] ArithmeticOperator
controllers/Question.js:31:19
       await getMaxquestion(req.params.userId, req.params.Part).then((item) => {
         max = item;
       })
-      const num = parseInt(req.params.number)+parseInt(max)
+      const num = parseInt(req.params.number) - parseInt(max)
       console.log(num)
       const queryConstraints = [where("Order", ">", max),where("Order", "<=", num)];

[NoCoverage] ArrayDeclaration
controllers/Question.js:33:32
       })
       const num = parseInt(req.params.number)+parseInt(max)
       console.log(num)
-      const queryConstraints = [where("Order", ">", max),where("Order", "<=", num)];
+      const queryConstraints = [];
       const q = query(
         myCollection,

[NoCoverage] BlockStatement
controllers/Question.js:40:52
       );
       const querySnapshot = await getDocs(q);
       // const list = querySnapshot.docs.map((doc) => doc.data());
-      const list = querySnapshot.docs.map((doc) => {
-        const data = doc.data();
-        const docId = doc.id;
-        return { ...data, Id: docId };
-      });
+      const list = querySnapshot.docs.map((doc) => {});
       res.json({ success: true, Questions: list });
     } catch (e) {

[NoCoverage] BooleanLiteral
controllers/Question.js:45:27
         const docId = doc.id;
         return { ...data, Id: docId };
       });
-      res.json({ success: true, Questions: list });
+      res.json({ success: false, Questions: list });
     } catch (e) {
       res.json({

[NoCoverage] BlockStatement
controllers/Question.js:46:17
         return { ...data, Id: docId };
       });
       res.json({ success: true, Questions: list });
-    } catch (e) {
-      res.json({
-        success: false,
-        message: "something went wrong when get data from getQuestion",
-      });
-      console.log(e);
-    }
+    } catch (e) {}
  }
  const pushHistoryUser1 = async (userId, id, part, quantity, sign) => {

[NoCoverage] ObjectLiteral
controllers/Question.js:47:16
       });
       res.json({ success: true, Questions: list });
     } catch (e) {
-      res.json({
-        success: false,
-        message: "something went wrong when get data from getQuestion",
-      });
+      res.json({});
       console.log(e);
     }

[NoCoverage] BooleanLiteral
controllers/Question.js:48:18
       res.json({ success: true, Questions: list });
     } catch (e) {
       res.json({
-        success: false,
+        success: true,
         message: "something went wrong when get data from getQuestion",
       });

[NoCoverage] ConditionalExpression
controllers/Question.js:59:10
    const docRef = doc(myCollection, userId);
    try {
      const documentSnapshot = await getDoc(docRef);
-     if (documentSnapshot.exists()) {
+     if (true) {
        const userData = documentSnapshot.data();
        const data = userData.HistoryPractice || [];

[NoCoverage] ConditionalExpression
controllers/Question.js:59:10
    const docRef = doc(myCollection, userId);
    try {
      const documentSnapshot = await getDoc(docRef);
-     if (documentSnapshot.exists()) {
+     if (false) {
        const userData = documentSnapshot.data();
        const data = userData.HistoryPractice || [];

[NoCoverage] ConditionalExpression
controllers/Question.js:61:21
      const documentSnapshot = await getDoc(docRef);
      if (documentSnapshot.exists()) {
        const userData = documentSnapshot.data();
-       const data = userData.HistoryPractice || [];
+       const data = false;
        data.unshift(id);
        await updateDoc(docRef, { HistoryPractice: data });

[NoCoverage] ConditionalExpression
controllers/Question.js:61:21
      const documentSnapshot = await getDoc(docRef);
      if (documentSnapshot.exists()) {
        const userData = documentSnapshot.data();
-       const data = userData.HistoryPractice || [];
+       const data = true;
        data.unshift(id);
        await updateDoc(docRef, { HistoryPractice: data });

[NoCoverage] ConditionalExpression
controllers/Question.js:64:11
        const data = userData.HistoryPractice || [];
        data.unshift(id);
        await updateDoc(docRef, { HistoryPractice: data });
-       if(sign!='noMax')
+       if(false)
        {
         let max = 0;

[NoCoverage] ConditionalExpression
controllers/Question.js:64:11
        const data = userData.HistoryPractice || [];
        data.unshift(id);
        await updateDoc(docRef, { HistoryPractice: data });
-       if(sign!='noMax')
+       if(true)
        {
         let max = 0;

[NoCoverage] BlockStatement
controllers/Question.js:65:8
        data.unshift(id);
        await updateDoc(docRef, { HistoryPractice: data });
        if(sign!='noMax')
-       {
-        let max = 0;
-       await getMaxquestion(userId, part).then((item) => {
-         max = item;
-       });
-       const num = parseInt(quantity) + parseInt(max);
-       if (part == "L1") {
-         const data2 = documentSnapshot.data().MaxQuestion || { L1: num };
-         data2.L1 = num;
-         await updateDoc(docRef, { MaxQuestion: data2 });
-       }
-       }
+       {}
      } 
      else {

[NoCoverage] BlockStatement
controllers/Question.js:67:58
        if(sign!='noMax')
        {
         let max = 0;
-       await getMaxquestion(userId, part).then((item) => {
-         max = item;
-       });
+       await getMaxquestion(userId, part).then((item) => {});
        const num = parseInt(quantity) + parseInt(max);
        if (part == "L1") {

[NoCoverage] ArithmeticOperator
controllers/Question.js:70:20
        await getMaxquestion(userId, part).then((item) => {
          max = item;
        });
-       const num = parseInt(quantity) + parseInt(max);
+       const num = parseInt(quantity) - parseInt(max);
        if (part == "L1") {
          const data2 = documentSnapshot.data().MaxQuestion || { L1: num };

[NoCoverage] BlockStatement
controllers/Question.js:71:26
          max = item;
        });
        const num = parseInt(quantity) + parseInt(max);
-       if (part == "L1") {
-         const data2 = documentSnapshot.data().MaxQuestion || { L1: num };
-         data2.L1 = num;
-         await updateDoc(docRef, { MaxQuestion: data2 });
-       }
+       if (part == "L1") {}
        }
      } 

[NoCoverage] ConditionalExpression
controllers/Question.js:71:12
          max = item;
        });
        const num = parseInt(quantity) + parseInt(max);
-       if (part == "L1") {
+       if (false) {
          const data2 = documentSnapshot.data().MaxQuestion || { L1: num };
          data2.L1 = num;

[NoCoverage] ConditionalExpression
controllers/Question.js:72:24
        });
        const num = parseInt(quantity) + parseInt(max);
        if (part == "L1") {
-         const data2 = documentSnapshot.data().MaxQuestion || { L1: num };
+         const data2 = false;
          data2.L1 = num;
          await updateDoc(docRef, { MaxQuestion: data2 });

[NoCoverage] LogicalOperator
controllers/Question.js:72:24
        });
        const num = parseInt(quantity) + parseInt(max);
        if (part == "L1") {
-         const data2 = documentSnapshot.data().MaxQuestion || { L1: num };
+         const data2 = documentSnapshot.data().MaxQuestion && {
+  L1: num
+};
          data2.L1 = num;
          await updateDoc(docRef, { MaxQuestion: data2 });

[NoCoverage] BlockStatement
controllers/Question.js:78:11
        }
        }
      } 
-     else {
-       const data = {
-         HistoryPractice: [id],
-       };
-       await setDoc(docRef, data);
-     }
+     else {}
    } catch (e) {
      console.log(e);

[NoCoverage] BlockStatement
controllers/Question.js:84:16
        };
        await setDoc(docRef, data);
      }
-   } catch (e) {
-     console.log(e);
-   }
+   } catch (e) {}
  };
  const pushPracticeHistory = async(req,res)=>{

[NoCoverage] BlockStatement
controllers/Question.js:88:46
      console.log(e);
    }
  };
- const pushPracticeHistory = async(req,res)=>{
-  const myCollection = collection(firestore, 'PracticeHistory');
-  try{
-    const data = req.body;
-    await addDoc(myCollection, data)
-    .then((docRef) => {
-      res.send({ message: 'Data saved successfully' });
-      pushHistoryUser1(req.params.userId,docRef.id, req.body.Part, req.body.Quantity,req.params.sign)
-    })
-    .catch((error) => {
-      console.error('Error adding document pushHistory: ', error);
-    });
-  }
-  catch (e) {
-    res.send({ message: 'Data not saved successfully' });
-    console.log(e);
-  }
- }
+ const pushPracticeHistory = async(req,res)=>{}
  const getOneQuestion = async(req,res)=>{
   const myCollection = collection(firestore, req.params.Part);

[NoCoverage] BlockStatement
controllers/Question.js:90:6
  };
  const pushPracticeHistory = async(req,res)=>{
   const myCollection = collection(firestore, 'PracticeHistory');
-  try{
-    const data = req.body;
-    await addDoc(myCollection, data)
-    .then((docRef) => {
-      res.send({ message: 'Data saved successfully' });
-      pushHistoryUser1(req.params.userId,docRef.id, req.body.Part, req.body.Quantity,req.params.sign)
-    })
-    .catch((error) => {
-      console.error('Error adding document pushHistory: ', error);
-    });
-  }
+  try{}
   catch (e) {
     res.send({ message: 'Data not saved successfully' });

[NoCoverage] BlockStatement
controllers/Question.js:93:23
   try{
     const data = req.body;
     await addDoc(myCollection, data)
-    .then((docRef) => {
-      res.send({ message: 'Data saved successfully' });
-      pushHistoryUser1(req.params.userId,docRef.id, req.body.Part, req.body.Quantity,req.params.sign)
-    })
+    .then((docRef) => {})
     .catch((error) => {
       console.error('Error adding document pushHistory: ', error);

[NoCoverage] StringLiteral
controllers/Question.js:94:27
     const data = req.body;
     await addDoc(myCollection, data)
     .then((docRef) => {
-      res.send({ message: 'Data saved successfully' });
+      res.send({ message: "" });
       pushHistoryUser1(req.params.userId,docRef.id, req.body.Part, req.body.Quantity,req.params.sign)
     })

[NoCoverage] BlockStatement
controllers/Question.js:97:23
       res.send({ message: 'Data saved successfully' });
       pushHistoryUser1(req.params.userId,docRef.id, req.body.Part, req.body.Quantity,req.params.sign)
     })
-    .catch((error) => {
-      console.error('Error adding document pushHistory: ', error);
-    });
+    .catch((error) => {});
   }
   catch (e) {

[NoCoverage] BlockStatement
controllers/Question.js:101:13
       console.error('Error adding document pushHistory: ', error);
     });
   }
-  catch (e) {
-    res.send({ message: 'Data not saved successfully' });
-    console.log(e);
-  }
+  catch (e) {}
  }
  const getOneQuestion = async(req,res)=>{

[NoCoverage] StringLiteral
controllers/Question.js:102:25
     });
   }
   catch (e) {
-    res.send({ message: 'Data not saved successfully' });
+    res.send({ message: "" });
     console.log(e);
   }

[NoCoverage] ObjectLiteral
controllers/Question.js:102:14
     });
   }
   catch (e) {
-    res.send({ message: 'Data not saved successfully' });
+    res.send({});
     console.log(e);
   }

[NoCoverage] BlockStatement
controllers/Question.js:106:41
     console.log(e);
   }
  }
- const getOneQuestion = async(req,res)=>{
-  const myCollection = collection(firestore, req.params.Part);
-    const docRef = doc(myCollection, req.params.Qid);
-    try{
-    const documentSnapshot = await getDoc(docRef);
-  
-  if (documentSnapshot.exists()) {
-    const data = {...documentSnapshot.data(),Id: documentSnapshot.id} || {};
-    res.json({success:true, question:data});
-  } else {
-    console.log('Document does not exist.');
-    res.json({success:true, question:{}});
-  }
-    }
-    catch(e){
-        console.log(e)
-    }
- }
+ const getOneQuestion = async(req,res)=>{}
 const get1PHistory = async(list)=>{
   const myCollection = collection(firestore, 'PracticeHistory');

[NoCoverage] BlockStatement
controllers/Question.js:109:8
  const getOneQuestion = async(req,res)=>{
   const myCollection = collection(firestore, req.params.Part);
     const docRef = doc(myCollection, req.params.Qid);
-    try{
-    const documentSnapshot = await getDoc(docRef);
-  
-  if (documentSnapshot.exists()) {
-    const data = {...documentSnapshot.data(),Id: documentSnapshot.id} || {};
-    res.json({success:true, question:data});
-  } else {
-    console.log('Document does not exist.');
-    res.json({success:true, question:{}});
-  }
-    }
+    try{}
     catch(e){
         console.log(e)

[NoCoverage] BlockStatement
controllers/Question.js:112:34
     try{
     const documentSnapshot = await getDoc(docRef);
   
-  if (documentSnapshot.exists()) {
-    const data = {...documentSnapshot.data(),Id: documentSnapshot.id} || {};
-    res.json({success:true, question:data});
-  } else {
+  if (documentSnapshot.exists()) {} else {
     console.log('Document does not exist.');
     res.json({success:true, question:{}});

[NoCoverage] LogicalOperator
controllers/Question.js:113:18
     const documentSnapshot = await getDoc(docRef);
   
   if (documentSnapshot.exists()) {
-    const data = {...documentSnapshot.data(),Id: documentSnapshot.id} || {};
+    const data = {
+  ...documentSnapshot.data(),
+  Id: documentSnapshot.id
+} && {};
     res.json({success:true, question:data});
   } else {

[NoCoverage] ConditionalExpression
controllers/Question.js:113:18
     const documentSnapshot = await getDoc(docRef);
   
   if (documentSnapshot.exists()) {
-    const data = {...documentSnapshot.data(),Id: documentSnapshot.id} || {};
+    const data = true;
     res.json({success:true, question:data});
   } else {

[NoCoverage] BooleanLiteral
controllers/Question.js:114:23
   
   if (documentSnapshot.exists()) {
     const data = {...documentSnapshot.data(),Id: documentSnapshot.id} || {};
-    res.json({success:true, question:data});
+    res.json({success:false, question:data});
   } else {
     console.log('Document does not exist.');

[NoCoverage] ObjectLiteral
controllers/Question.js:114:14
   
   if (documentSnapshot.exists()) {
     const data = {...documentSnapshot.data(),Id: documentSnapshot.id} || {};
-    res.json({success:true, question:data});
+    res.json({});
   } else {
     console.log('Document does not exist.');

[NoCoverage] BlockStatement
controllers/Question.js:115:10
   if (documentSnapshot.exists()) {
     const data = {...documentSnapshot.data(),Id: documentSnapshot.id} || {};
     res.json({success:true, question:data});
-  } else {
-    console.log('Document does not exist.');
-    res.json({success:true, question:{}});
-  }
+  } else {}
     }
     catch(e){

[NoCoverage] BooleanLiteral
controllers/Question.js:117:23
     res.json({success:true, question:data});
   } else {
     console.log('Document does not exist.');
-    res.json({success:true, question:{}});
+    res.json({success:false, question:{}});
   }
     }

[NoCoverage] BlockStatement
controllers/Question.js:120:13
     res.json({success:true, question:{}});
   }
     }
-    catch(e){
-        console.log(e)
-    }
+    catch(e){}
  }
 const get1PHistory = async(list)=>{

[NoCoverage] BlockStatement
controllers/Question.js:124:35
         console.log(e)
     }
  }
-const get1PHistory = async(list)=>{
-  const myCollection = collection(firestore, 'PracticeHistory');
-  const dataList=[];
-  for(let i = 0; i < list.length; i++){
-    const docRef = doc(myCollection, list[i]);
-    try{
-    const documentSnapshot = await getDoc(docRef);
-  
-  if (documentSnapshot.exists()) {
-    const data = {...documentSnapshot.data(), Id: documentSnapshot.id} || {};
-    dataList.push(data)
-  } 
-    }
-    catch(e){
-        console.log(e)
-    }
-  }
-  return dataList;
- }
+const get1PHistory = async(list)=>{}
  module.exports={getQuestion, pushPracticeHistory, getOneQuestion, get1PHistory}

[NoCoverage] BlockStatement
controllers/Question.js:127:39
 const get1PHistory = async(list)=>{
   const myCollection = collection(firestore, 'PracticeHistory');
   const dataList=[];
-  for(let i = 0; i < list.length; i++){
-    const docRef = doc(myCollection, list[i]);
-    try{
-    const documentSnapshot = await getDoc(docRef);
-  
-  if (documentSnapshot.exists()) {
-    const data = {...documentSnapshot.data(), Id: documentSnapshot.id} || {};
-    dataList.push(data)
-  } 
-    }
-    catch(e){
-        console.log(e)
-    }
-  }
+  for(let i = 0; i < list.length; i++){}
   return dataList;
  }

[NoCoverage] EqualityOperator
controllers/Question.js:127:18
 const get1PHistory = async(list)=>{
   const myCollection = collection(firestore, 'PracticeHistory');
   const dataList=[];
-  for(let i = 0; i < list.length; i++){
+  for(let i = 0; i >= list.length; i++){
     const docRef = doc(myCollection, list[i]);
     try{

[NoCoverage] BlockStatement
controllers/Question.js:129:8
   const dataList=[];
   for(let i = 0; i < list.length; i++){
     const docRef = doc(myCollection, list[i]);
-    try{
-    const documentSnapshot = await getDoc(docRef);
-  
-  if (documentSnapshot.exists()) {
-    const data = {...documentSnapshot.data(), Id: documentSnapshot.id} || {};
-    dataList.push(data)
-  } 
-    }
+    try{}
     catch(e){
         console.log(e)

[NoCoverage] ConditionalExpression
controllers/Question.js:133:18
     const documentSnapshot = await getDoc(docRef);
   
   if (documentSnapshot.exists()) {
-    const data = {...documentSnapshot.data(), Id: documentSnapshot.id} || {};
+    const data = false;
     dataList.push(data)
   } 
