[NoCoverage] BlockStatement
controllers/SWskills.js:17:9
     // const file = bucket.file(fileName);
     // const audioBuffer = Buffer.from(audioData, 'base64');
     const audioRef = ref(storage, fileName);
-    try {
-        // await file.save(audioBuffer, {
-        //     metadata: {
-        //         contentType: 'audio/mpeg', 
-        //     },
-        // });
-
-        // const downloadUrl = `https://storage.googleapis.com/${bucket.name}/${fileName}`;
-        // res.send({ success: true, downloadUrl: downloadUrl });
-
-        await uploadString(audioRef, audioData, 'base64', { contentType: 'audio/mpeg' });
-
-        const downloadURL = await getDownloadURL(audioRef);
-        console.log(downloadURL);
-        res.json({ success: true, downloadUrl: downloadURL })
-
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error uploading audio:', error);
         res.status(500).send({ success: false, message: 'Upload audio failed' });

[NoCoverage] StringLiteral
controllers/SWskills.js:27:49
         // const downloadUrl = `https://storage.googleapis.com/${bucket.name}/${fileName}`;
         // res.send({ success: true, downloadUrl: downloadUrl });
 
-        await uploadString(audioRef, audioData, 'base64', { contentType: 'audio/mpeg' });
+        await uploadString(audioRef, audioData, "", { contentType: 'audio/mpeg' });
 
         const downloadURL = await getDownloadURL(audioRef);

[NoCoverage] StringLiteral
controllers/SWskills.js:27:74
         // const downloadUrl = `https://storage.googleapis.com/${bucket.name}/${fileName}`;
         // res.send({ success: true, downloadUrl: downloadUrl });
 
-        await uploadString(audioRef, audioData, 'base64', { contentType: 'audio/mpeg' });
+        await uploadString(audioRef, audioData, 'base64', { contentType: "" });
 
         const downloadURL = await getDownloadURL(audioRef);

[NoCoverage] BooleanLiteral
controllers/SWskills.js:31:29
 
         const downloadURL = await getDownloadURL(audioRef);
         console.log(downloadURL);
-        res.json({ success: true, downloadUrl: downloadURL })
+        res.json({ success: false, downloadUrl: downloadURL })
 
     } catch (error) {

[NoCoverage] ObjectLiteral
controllers/SWskills.js:31:18
 
         const downloadURL = await getDownloadURL(audioRef);
         console.log(downloadURL);
-        res.json({ success: true, downloadUrl: downloadURL })
+        res.json({})
 
     } catch (error) {

[NoCoverage] BlockStatement
controllers/SWskills.js:33:21
         console.log(downloadURL);
         res.json({ success: true, downloadUrl: downloadURL })
 
-    } catch (error) {
-        console.error('Error uploading audio:', error);
-        res.status(500).send({ success: false, message: 'Upload audio failed' });
-    }
+    } catch (error) {}
 };
 const uploadPracticeHistory = async (req, res) => {

[NoCoverage] BooleanLiteral
controllers/SWskills.js:35:41
 
     } catch (error) {
         console.error('Error uploading audio:', error);
-        res.status(500).send({ success: false, message: 'Upload audio failed' });
+        res.status(500).send({ success: true, message: 'Upload audio failed' });
     }
 };

[NoCoverage] StringLiteral
controllers/SWskills.js:35:57
 
     } catch (error) {
         console.error('Error uploading audio:', error);
-        res.status(500).send({ success: false, message: 'Upload audio failed' });
+        res.status(500).send({ success: false, message: "" });
     }
 };

[NoCoverage] BlockStatement
controllers/SWskills.js:38:51
         res.status(500).send({ success: false, message: 'Upload audio failed' });
     }
 };
-const uploadPracticeHistory = async (req, res) => {
-    try {
-        const myCollection = collection(firestore, 'PracticeHistory');
-        await addDoc(myCollection, req.body);
-        console.log("Document successfully post!");
-        res.send({ message: 'Practice History post successfully' });
-      } catch (error) {
-        console.error("Error post history document: ", error);
-        res.status(500).json({ success: false, message: error.message });
-      }
-}
+const uploadPracticeHistory = async (req, res) => {}
 
 module.exports = { uploadAudio, uploadPracticeHistory };

[NoCoverage] BlockStatement
controllers/SWskills.js:39:9
     }
 };
 const uploadPracticeHistory = async (req, res) => {
-    try {
-        const myCollection = collection(firestore, 'PracticeHistory');
-        await addDoc(myCollection, req.body);
-        console.log("Document successfully post!");
-        res.send({ message: 'Practice History post successfully' });
-      } catch (error) {
+    try {} catch (error) {
         console.error("Error post history document: ", error);
         res.status(500).json({ success: false, message: error.message });

[NoCoverage] ObjectLiteral
controllers/SWskills.js:43:18
         const myCollection = collection(firestore, 'PracticeHistory');
         await addDoc(myCollection, req.body);
         console.log("Document successfully post!");
-        res.send({ message: 'Practice History post successfully' });
+        res.send({});
       } catch (error) {
         console.error("Error post history document: ", error);

[NoCoverage] BlockStatement
controllers/SWskills.js:44:23
         await addDoc(myCollection, req.body);
         console.log("Document successfully post!");
         res.send({ message: 'Practice History post successfully' });
-      } catch (error) {
-        console.error("Error post history document: ", error);
-        res.status(500).json({ success: false, message: error.message });
-      }
+      } catch (error) {}
 }
 

[NoCoverage] BooleanLiteral
controllers/SWskills.js:46:41
         res.send({ message: 'Practice History post successfully' });
       } catch (error) {
         console.error("Error post history document: ", error);
-        res.status(500).json({ success: false, message: error.message });
+        res.status(500).json({ success: true, message: error.message });
       }
 }
