[NoCoverage] BlockStatement
controllers/User.js:23:36
 //       });
 //       return token
 // }
-const retrieveUserToken = async()=>{
-    const myCollection = collection(firestore, 'Users');
-    try{
-        const querySnapshot = await getDocs(myCollection);
-        const docRef = doc(myCollection, req.params.userId);
-        const documentSnapshot = await getDoc(docRef);
-  
-        if (documentSnapshot.exists()) {
-          const data = documentSnapshot.data().token;
-        //   res.json({success:true, vocabAlarm:data});
-        } else {
-          console.log('Document does not exist.');
-        //   res.json({success:true, vocabAlarm:'-1'});
-        }
-        }
-        catch(e){
-            console.log(e);
-            res.json({
-              success: false,
-              message: "something went wrong when get data from getVocabs",
-            });
-            return [];
-        }
-  //   return token
-}
+const retrieveUserToken = async()=>{}
 const createNotiBody = async(id)=>{
     const myCollection = collection(firestore, 'Vocabulary');

[NoCoverage] BlockStatement
controllers/User.js:25:8
 // }
 const retrieveUserToken = async()=>{
     const myCollection = collection(firestore, 'Users');
-    try{
-        const querySnapshot = await getDocs(myCollection);
-        const docRef = doc(myCollection, req.params.userId);
-        const documentSnapshot = await getDoc(docRef);
-  
-        if (documentSnapshot.exists()) {
-          const data = documentSnapshot.data().token;
-        //   res.json({success:true, vocabAlarm:data});
-        } else {
-          console.log('Document does not exist.');
-        //   res.json({success:true, vocabAlarm:'-1'});
-        }
-        }
+    try{}
         catch(e){
             console.log(e);

[NoCoverage] BlockStatement
controllers/User.js:30:40
         const docRef = doc(myCollection, req.params.userId);
         const documentSnapshot = await getDoc(docRef);
   
-        if (documentSnapshot.exists()) {
-          const data = documentSnapshot.data().token;
-        //   res.json({success:true, vocabAlarm:data});
-        } else {
+        if (documentSnapshot.exists()) {} else {
           console.log('Document does not exist.');
         //   res.json({success:true, vocabAlarm:'-1'});

[NoCoverage] BlockStatement
controllers/User.js:33:16
         if (documentSnapshot.exists()) {
           const data = documentSnapshot.data().token;
         //   res.json({success:true, vocabAlarm:data});
-        } else {
-          console.log('Document does not exist.');
-        //   res.json({success:true, vocabAlarm:'-1'});
-        }
+        } else {}
         }
         catch(e){

[NoCoverage] BlockStatement
controllers/User.js:38:17
         //   res.json({success:true, vocabAlarm:'-1'});
         }
         }
-        catch(e){
-            console.log(e);
-            res.json({
-              success: false,
-              message: "something went wrong when get data from getVocabs",
-            });
-            return [];
-        }
+        catch(e){}
   //   return token
 }

[NoCoverage] BlockStatement
controllers/User.js:48:35
         }
   //   return token
 }
-const createNotiBody = async(id)=>{
-    const myCollection = collection(firestore, 'Vocabulary');
-    const docRef = doc(myCollection, id);
-    const documentSnapshot = await getDoc(docRef);
-  
-  if (documentSnapshot.exists()) {
-    const data = documentSnapshot.data()
-    const body = data.Vocab +" "+ data.Spelling +" ("+ data.Type +") "+ data.Translate
-    return body
-  } else {
-    console.log('Document does not exist.');
-  }
-}
+const createNotiBody = async(id)=>{}
 const sendNotification=async(token, message)=>{
     let data = '';

[NoCoverage] BlockStatement
controllers/User.js:53:34
     const docRef = doc(myCollection, id);
     const documentSnapshot = await getDoc(docRef);
   
-  if (documentSnapshot.exists()) {
-    const data = documentSnapshot.data()
-    const body = data.Vocab +" "+ data.Spelling +" ("+ data.Type +") "+ data.Translate
-    return body
-  } else {
+  if (documentSnapshot.exists()) {} else {
     console.log('Document does not exist.');
   }

[NoCoverage] BlockStatement
controllers/User.js:57:10
     const data = documentSnapshot.data()
     const body = data.Vocab +" "+ data.Spelling +" ("+ data.Type +") "+ data.Translate
     return body
-  } else {
-    console.log('Document does not exist.');
-  }
+  } else {}
 }
 const sendNotification=async(token, message)=>{

[NoCoverage] BlockStatement
controllers/User.js:63:48
 }
 const sendNotification=async(token, message)=>{
     let data = '';
-    await createNotiBody(message).then(item => { data = item});
+    await createNotiBody(message).then(item => {});
     const notificationPayload = {
       notification: {

[NoCoverage] ObjectLiteral
controllers/User.js:64:33
 const sendNotification=async(token, message)=>{
     let data = '';
     await createNotiBody(message).then(item => { data = item});
-    const notificationPayload = {
-      notification: {
-        title: 'Alarm Vocab',
-        body: data,
-      },
-    };
+    const notificationPayload = {};
   
     // Send the notification to the specific user's token

[NoCoverage] BlockStatement
controllers/User.js:73:27
   
     // Send the notification to the specific user's token
     admin.messaging().sendToDevice(token, notificationPayload)
-      .then((response) => {
-        console.log('Notification sent successfully:', response.results);
-      })
+      .then((response) => {})
       .catch((error) => {
         console.error('Error sending notification:', error);

[NoCoverage] BlockStatement
controllers/User.js:76:25
       .then((response) => {
         console.log('Notification sent successfully:', response.results);
       })
-      .catch((error) => {
-        console.error('Error sending notification:', error);
-      });
+      .catch((error) => {});
     //console.log("token"+token)
     // admin.messaging().send({

[NoCoverage] StringLiteral
controllers/User.js:77:23
         console.log('Notification sent successfully:', response.results);
       })
       .catch((error) => {
-        console.error('Error sending notification:', error);
+        console.error("", error);
       });
     //console.log("token"+token)

[NoCoverage] BlockStatement
controllers/User.js:91:43
     //     console.error('Error sending notification:', error);
     // });
   }
-  const setUserInfo = async (req, res) => {
-    try {
-      const myCollection = collection(firestore, 'Users');
-      const docRef1 = doc(myCollection, req.params.userId);
-      await setDoc(docRef1, req.body);
-      console.log("Document successfully set!");
-      res.send({ message: 'User data set successfully' });
-    } catch (error) {
-      console.error("Error setting user document: ", error);
-      res.status(500).json({ success: false, message: error.message });
-    }
-  };
+  const setUserInfo = async (req, res) => {};
   const updateUser = async (req, res) => {
     try {

[NoCoverage] BlockStatement
controllers/User.js:92:9
     // });
   }
   const setUserInfo = async (req, res) => {
-    try {
-      const myCollection = collection(firestore, 'Users');
-      const docRef1 = doc(myCollection, req.params.userId);
-      await setDoc(docRef1, req.body);
-      console.log("Document successfully set!");
-      res.send({ message: 'User data set successfully' });
-    } catch (error) {
+    try {} catch (error) {
       console.error("Error setting user document: ", error);
       res.status(500).json({ success: false, message: error.message });

[NoCoverage] StringLiteral
controllers/User.js:96:19
       const myCollection = collection(firestore, 'Users');
       const docRef1 = doc(myCollection, req.params.userId);
       await setDoc(docRef1, req.body);
-      console.log("Document successfully set!");
+      console.log("");
       res.send({ message: 'User data set successfully' });
     } catch (error) {

[NoCoverage] BlockStatement
controllers/User.js:98:21
       await setDoc(docRef1, req.body);
       console.log("Document successfully set!");
       res.send({ message: 'User data set successfully' });
-    } catch (error) {
-      console.error("Error setting user document: ", error);
-      res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
   };
   const updateUser = async (req, res) => {

[NoCoverage] BooleanLiteral
controllers/User.js:100:39
       res.send({ message: 'User data set successfully' });
     } catch (error) {
       console.error("Error setting user document: ", error);
-      res.status(500).json({ success: false, message: error.message });
+      res.status(500).json({ success: true, message: error.message });
     }
   };

[NoCoverage] ObjectLiteral
controllers/User.js:100:28
       res.send({ message: 'User data set successfully' });
     } catch (error) {
       console.error("Error setting user document: ", error);
-      res.status(500).json({ success: false, message: error.message });
+      res.status(500).json({});
     }
   };

[NoCoverage] BlockStatement
controllers/User.js:103:42
       res.status(500).json({ success: false, message: error.message });
     }
   };
-  const updateUser = async (req, res) => {
-    try {
-      const myCollection = collection(firestore, 'Users');
-      const docRef1 = doc(myCollection, req.params.userId);
-
-      await updateDoc(docRef1, req.body);
-      console.log("Document successfully updated!");
-      res.send({ message: 'User data set successfully' });
-    } catch (error) {
-      console.error("Error updating user document: ", error);
-      res.status(500).json({ success: false, message: error.message });
-    }
-  };
+  const updateUser = async (req, res) => {};
   const getUserData = async (req, res) => {
     try {

[NoCoverage] BlockStatement
controllers/User.js:104:9
     }
   };
   const updateUser = async (req, res) => {
-    try {
-      const myCollection = collection(firestore, 'Users');
-      const docRef1 = doc(myCollection, req.params.userId);
-
-      await updateDoc(docRef1, req.body);
-      console.log("Document successfully updated!");
-      res.send({ message: 'User data set successfully' });
-    } catch (error) {
+    try {} catch (error) {
       console.error("Error updating user document: ", error);
       res.status(500).json({ success: false, message: error.message });

[NoCoverage] ObjectLiteral
controllers/User.js:110:16
 
       await updateDoc(docRef1, req.body);
       console.log("Document successfully updated!");
-      res.send({ message: 'User data set successfully' });
+      res.send({});
     } catch (error) {
       console.error("Error updating user document: ", error);

[NoCoverage] BlockStatement
controllers/User.js:111:21
       await updateDoc(docRef1, req.body);
       console.log("Document successfully updated!");
       res.send({ message: 'User data set successfully' });
-    } catch (error) {
-      console.error("Error updating user document: ", error);
-      res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
   };
   const getUserData = async (req, res) => {

[NoCoverage] BooleanLiteral
controllers/User.js:113:39
       res.send({ message: 'User data set successfully' });
     } catch (error) {
       console.error("Error updating user document: ", error);
-      res.status(500).json({ success: false, message: error.message });
+      res.status(500).json({ success: true, message: error.message });
     }
   };

[NoCoverage] ObjectLiteral
controllers/User.js:113:28
       res.send({ message: 'User data set successfully' });
     } catch (error) {
       console.error("Error updating user document: ", error);
-      res.status(500).json({ success: false, message: error.message });
+      res.status(500).json({});
     }
   };

[NoCoverage] BlockStatement
controllers/User.js:116:43
       res.status(500).json({ success: false, message: error.message });
     }
   };
-  const getUserData = async (req, res) => {
-    try {
-
-      const myCollection = collection(firestore, 'Users');
-      const docRef1 = doc(myCollection, req.params.userId);
-      const documentSnapshot = await getDoc(docRef1);
-
-      if (documentSnapshot.exists()) {
-        res.send({ success: true, userData: documentSnapshot.data() });
-      } else {
-        res.status(404).send({ success: false, message: 'User not found' });
-      }
-    } catch (error) {
-      console.error("Error get user document: ", error);
-      res.status(500).json({ success: false, message: error.message });
-    }
-  };
+  const getUserData = async (req, res) => {};
   const getAllUsers = async (req, res) => {
     const myCollection = collection(firestore, 'Users');

[NoCoverage] BlockStatement
controllers/User.js:117:9
     }
   };
   const getUserData = async (req, res) => {
-    try {
-
-      const myCollection = collection(firestore, 'Users');
-      const docRef1 = doc(myCollection, req.params.userId);
-      const documentSnapshot = await getDoc(docRef1);
-
-      if (documentSnapshot.exists()) {
-        res.send({ success: true, userData: documentSnapshot.data() });
-      } else {
-        res.status(404).send({ success: false, message: 'User not found' });
-      }
-    } catch (error) {
+    try {} catch (error) {
       console.error("Error get user document: ", error);
       res.status(500).json({ success: false, message: error.message });

[NoCoverage] StringLiteral
controllers/User.js:119:50
   const getUserData = async (req, res) => {
     try {
 
-      const myCollection = collection(firestore, 'Users');
+      const myCollection = collection(firestore, "");
       const docRef1 = doc(myCollection, req.params.userId);
       const documentSnapshot = await getDoc(docRef1);

[NoCoverage] BlockStatement
controllers/User.js:123:38
       const docRef1 = doc(myCollection, req.params.userId);
       const documentSnapshot = await getDoc(docRef1);
 
-      if (documentSnapshot.exists()) {
-        res.send({ success: true, userData: documentSnapshot.data() });
-      } else {
+      if (documentSnapshot.exists()) {} else {
         res.status(404).send({ success: false, message: 'User not found' });
       }

[NoCoverage] BooleanLiteral
controllers/User.js:124:29
       const documentSnapshot = await getDoc(docRef1);
 
       if (documentSnapshot.exists()) {
-        res.send({ success: true, userData: documentSnapshot.data() });
+        res.send({ success: false, userData: documentSnapshot.data() });
       } else {
         res.status(404).send({ success: false, message: 'User not found' });

[NoCoverage] BlockStatement
controllers/User.js:125:14
 
       if (documentSnapshot.exists()) {
         res.send({ success: true, userData: documentSnapshot.data() });
-      } else {
-        res.status(404).send({ success: false, message: 'User not found' });
-      }
+      } else {}
     } catch (error) {
       console.error("Error get user document: ", error);

[NoCoverage] BooleanLiteral
controllers/User.js:126:41
       if (documentSnapshot.exists()) {
         res.send({ success: true, userData: documentSnapshot.data() });
       } else {
-        res.status(404).send({ success: false, message: 'User not found' });
+        res.status(404).send({ success: true, message: 'User not found' });
       }
     } catch (error) {

[NoCoverage] BlockStatement
controllers/User.js:128:21
       } else {
         res.status(404).send({ success: false, message: 'User not found' });
       }
-    } catch (error) {
-      console.error("Error get user document: ", error);
-      res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
   };
   const getAllUsers = async (req, res) => {

[NoCoverage] BooleanLiteral
controllers/User.js:130:39
       }
     } catch (error) {
       console.error("Error get user document: ", error);
-      res.status(500).json({ success: false, message: error.message });
+      res.status(500).json({ success: true, message: error.message });
     }
   };

[NoCoverage] BlockStatement
controllers/User.js:133:43
       res.status(500).json({ success: false, message: error.message });
     }
   };
-  const getAllUsers = async (req, res) => {
-    const myCollection = collection(firestore, 'Users');
-    try{
-    const querySnapshot = await getDocs(myCollection);
-    const list = querySnapshot.docs.map((doc) => {
-      const data = doc.data();
-      return { ...data };
-    });
-    res.json({success:true, users:list});
-    }
-    catch(e){
-        res.json({success:false, message: error.message})
-        console.log(e)
-    }
-  };
+  const getAllUsers = async (req, res) => {};
   module.exports={retrieveUserToken, sendNotification, setUserInfo, updateUser, getAllUsers, getUserData}

[NoCoverage] StringLiteral
controllers/User.js:134:48
     }
   };
   const getAllUsers = async (req, res) => {
-    const myCollection = collection(firestore, 'Users');
+    const myCollection = collection(firestore, "");
     try{
     const querySnapshot = await getDocs(myCollection);

[NoCoverage] BlockStatement
controllers/User.js:135:8
   };
   const getAllUsers = async (req, res) => {
     const myCollection = collection(firestore, 'Users');
-    try{
-    const querySnapshot = await getDocs(myCollection);
-    const list = querySnapshot.docs.map((doc) => {
-      const data = doc.data();
-      return { ...data };
-    });
-    res.json({success:true, users:list});
-    }
+    try{}
     catch(e){
         res.json({success:false, message: error.message})

[NoCoverage] BlockStatement
controllers/User.js:137:50
     const myCollection = collection(firestore, 'Users');
     try{
     const querySnapshot = await getDocs(myCollection);
-    const list = querySnapshot.docs.map((doc) => {
-      const data = doc.data();
-      return { ...data };
-    });
+    const list = querySnapshot.docs.map((doc) => {});
     res.json({success:true, users:list});
     }

[NoCoverage] ObjectLiteral
controllers/User.js:139:14
     const querySnapshot = await getDocs(myCollection);
     const list = querySnapshot.docs.map((doc) => {
       const data = doc.data();
-      return { ...data };
+      return {};
     });
     res.json({success:true, users:list});

[NoCoverage] BooleanLiteral
controllers/User.js:141:23
       const data = doc.data();
       return { ...data };
     });
-    res.json({success:true, users:list});
+    res.json({success:false, users:list});
     }
     catch(e){

[NoCoverage] BlockStatement
controllers/User.js:143:13
     });
     res.json({success:true, users:list});
     }
-    catch(e){
-        res.json({success:false, message: error.message})
-        console.log(e)
-    }
+    catch(e){}
   };
   module.exports={retrieveUserToken, sendNotification, setUserInfo, updateUser, getAllUsers, getUserData}

[NoCoverage] BooleanLiteral
controllers/User.js:144:27
     res.json({success:true, users:list});
     }
     catch(e){
-        res.json({success:false, message: error.message})
+        res.json({success:true, message: error.message})
         console.log(e)
     }

[NoCoverage] ObjectLiteral
controllers/User.js:144:18
     res.json({success:true, users:list});
     }
     catch(e){
-        res.json({success:false, message: error.message})
+        res.json({})
         console.log(e)
     }
