[Killed] StringLiteral
controllers/Vocab.js:6:48
 const firestore = getFirestore(firebase);
 // const myCollection = collection(firestore, 'VocabLesson');
 const getVocabLesson = async (req,res)=>{
-    const myCollection = collection(firestore, 'VocabLesson');
+    const myCollection = collection(firestore, "");
     try{
       // db.collection('VocabLesson')
killedBy: getVocabLesson should return the list of vocab lessons if Firestore query is successful
statusReason: Error: listen EADDRINUSE: address already in use :::3000

[Timeout] BlockStatement
controllers/Vocab.js:7:8
 // const myCollection = collection(firestore, 'VocabLesson');
 const getVocabLesson = async (req,res)=>{
     const myCollection = collection(firestore, 'VocabLesson');
-    try{
-      // db.collection('VocabLesson')
-      // .doc()
-      // .get((doc)=>{
-      //   const list = doc.docs.map((doc) => {
-      //     const data = doc.data();
-      //     const docId = doc.id;
-      //     return { ...data, Id: docId };
-      //   });
-      // res.json({success:true, vocablesson:list});
-      // })
-    const querySnapshot = await getDocs(myCollection);
-    // const list = querySnapshot.docs.map((doc) => doc.data());
-    const list = querySnapshot.docs.map((doc) => {
-        const data = doc.data();
-        const docId = doc.id;
-        return { ...data, Id: docId };
-      });
-    res.json({success:true, vocablesson:list});
-    }
+    try{}
     catch(e){
         res.json({

[Killed] BooleanLiteral
controllers/Vocab.js:25:23
         const docId = doc.id;
         return { ...data, Id: docId };
       });
-    res.json({success:true, vocablesson:list});
+    res.json({success:false, vocablesson:list});
     }
     catch(e){
killedBy: getVocabLesson should return the list of vocab lessons if Firestore query is successful
statusReason: Error: listen EADDRINUSE: address already in use :::3000

[Timeout] BlockStatement
controllers/Vocab.js:27:13
       });
     res.json({success:true, vocablesson:list});
     }
-    catch(e){
-        res.json({
-            success:false,
-            message:'something went wrong when get data from vocablesson'
-        })
-        console.log(e)
-    }
+    catch(e){}
 }
  const getVocabs = async (req,res)=>{

[Killed] StringLiteral
controllers/Vocab.js:30:21
     catch(e){
         res.json({
             success:false,
-            message:'something went wrong when get data from vocablesson'
+            message:""
         })
         console.log(e)
killedBy: getVocabLesson should return an alert error if an error occurs
statusReason: Error: listen EADDRINUSE: address already in use :::3000

[Timeout] BlockStatement
controllers/Vocab.js:35:37
         console.log(e)
     }
 }
- const getVocabs = async (req,res)=>{
-    const myCollection = collection(firestore, 'Vocabulary');
-    try{
-        const querySnapshot = await getDocs(myCollection);
-        // const list = querySnapshot.docs.map((doc) => doc.data());
-        const list = querySnapshot.docs.map((doc) => {
-            const data = doc.data();
-            const docId = doc.id;
-            return { ...data, Id: docId };
-          });
-         res.json({success:true, vocabs:list});
-         return list
-        }
-        catch(e){
-            console.log(e);
-            res.json({
-              success: false,
-              message: "something went wrong when get data from getVocabs",
-            });
-            return [];
-        }
- }
+ const getVocabs = async (req,res)=>{}
 //  const filterVocab = async(IdLesson) => {
 //   const result = await getVocabs(null, {});

[Killed] StringLiteral
controllers/Vocab.js:36:48
     }
 }
  const getVocabs = async (req,res)=>{
-    const myCollection = collection(firestore, 'Vocabulary');
+    const myCollection = collection(firestore, "");
     try{
         const querySnapshot = await getDocs(myCollection);
killedBy: getVocabs should return a list of vocabs if successful
statusReason: Error: listen EADDRINUSE: address already in use :::3000

[Timeout] BlockStatement
controllers/Vocab.js:37:8
 }
  const getVocabs = async (req,res)=>{
     const myCollection = collection(firestore, 'Vocabulary');
-    try{
-        const querySnapshot = await getDocs(myCollection);
-        // const list = querySnapshot.docs.map((doc) => doc.data());
-        const list = querySnapshot.docs.map((doc) => {
-            const data = doc.data();
-            const docId = doc.id;
-            return { ...data, Id: docId };
-          });
-         res.json({success:true, vocabs:list});
-         return list
-        }
+    try{}
         catch(e){
             console.log(e);

[Killed] BooleanLiteral
controllers/Vocab.js:45:28
             const docId = doc.id;
             return { ...data, Id: docId };
           });
-         res.json({success:true, vocabs:list});
+         res.json({success:false, vocabs:list});
          return list
         }
killedBy: getVocabs should return a list of vocabs if successful
statusReason: Error: listen EADDRINUSE: address already in use :::3000

[Killed] ObjectLiteral
controllers/Vocab.js:45:19
             const docId = doc.id;
             return { ...data, Id: docId };
           });
-         res.json({success:true, vocabs:list});
+         res.json({});
          return list
         }
killedBy: getVocabs should return a list of vocabs if successful
statusReason: Error: listen EADDRINUSE: address already in use :::3000

[Timeout] BlockStatement
controllers/Vocab.js:62:44
 //   const list = result.filter(i=>i.TopicId == IdLesson);
 //     return list
 //  }
- const getVocabinLesson = async (req,res)=>{
-  const myCollection = collection(firestore, 'Vocabulary');
-    try {
-         const querySnapshot = await getDocs(myCollection);
-         const list = querySnapshot.docs.map((doc) => {
-          if(doc.data().TopicId == req.params.TopicId){
-             const data = doc.data();
-             const docId = doc.id;
-             return { ...data, Id: docId };
-          }
-           });
-          res.json({success:true, vocabs:list});
-    } catch (e) {
-      console.log(e);
-      res.json({
-        success: false,
-        message: "something went wrong when get data from getVocabinLesson",
-      });
-      return [];
-    }
-
- }
+ const getVocabinLesson = async (req,res)=>{}
  const setAlarmVocab = async(req,res)=>{
     const myCollection = collection(firestore, 'Users');

[Killed] StringLiteral
controllers/Vocab.js:63:46
 //     return list
 //  }
  const getVocabinLesson = async (req,res)=>{
-  const myCollection = collection(firestore, 'Vocabulary');
+  const myCollection = collection(firestore, "");
     try {
          const querySnapshot = await getDocs(myCollection);
killedBy: getVocabinLesson should return the list of vocabs in a Lesson if Firestore query is successful
statusReason: Error: listen EADDRINUSE: address already in use :::3000

[Timeout] BlockStatement
controllers/Vocab.js:64:9
 //  }
  const getVocabinLesson = async (req,res)=>{
   const myCollection = collection(firestore, 'Vocabulary');
-    try {
-         const querySnapshot = await getDocs(myCollection);
-         const list = querySnapshot.docs.map((doc) => {
-          if(doc.data().TopicId == req.params.TopicId){
-             const data = doc.data();
-             const docId = doc.id;
-             return { ...data, Id: docId };
-          }
-           });
-          res.json({success:true, vocabs:list});
-    } catch (e) {
+    try {} catch (e) {
       console.log(e);
       res.json({

[Killed] BlockStatement
controllers/Vocab.js:66:55
   const myCollection = collection(firestore, 'Vocabulary');
     try {
          const querySnapshot = await getDocs(myCollection);
-         const list = querySnapshot.docs.map((doc) => {
-          if(doc.data().TopicId == req.params.TopicId){
-             const data = doc.data();
-             const docId = doc.id;
-             return { ...data, Id: docId };
-          }
-           });
+         const list = querySnapshot.docs.map((doc) => {});
           res.json({success:true, vocabs:list});
     } catch (e) {
killedBy: getVocabinLesson should return the list of vocabs in a Lesson if Firestore query is successful
statusReason: Error: listen EADDRINUSE: address already in use :::3000

[Killed] ConditionalExpression
controllers/Vocab.js:67:14
     try {
          const querySnapshot = await getDocs(myCollection);
          const list = querySnapshot.docs.map((doc) => {
-          if(doc.data().TopicId == req.params.TopicId){
+          if(true){
              const data = doc.data();
              const docId = doc.id;
killedBy: getVocabinLesson should return the list of vocabs in a Lesson if Firestore query is successful
statusReason: Error: listen EADDRINUSE: address already in use :::3000

[Killed] EqualityOperator
controllers/Vocab.js:67:14
     try {
          const querySnapshot = await getDocs(myCollection);
          const list = querySnapshot.docs.map((doc) => {
-          if(doc.data().TopicId == req.params.TopicId){
+          if(doc.data().TopicId != req.params.TopicId){
              const data = doc.data();
              const docId = doc.id;
killedBy: getVocabinLesson should return the list of vocabs in a Lesson if Firestore query is successful
statusReason: Error: listen EADDRINUSE: address already in use :::3000

[Killed] BlockStatement
controllers/Vocab.js:74:17
           }
            });
           res.json({success:true, vocabs:list});
-    } catch (e) {
-      console.log(e);
-      res.json({
-        success: false,
-        message: "something went wrong when get data from getVocabinLesson",
-      });
-      return [];
-    }
+    } catch (e) {}
 
  }
killedBy: getVocabinLesson should return an alert error if an error occurs
statusReason: Error: listen EADDRINUSE: address already in use :::3000

[Killed] StringLiteral
controllers/Vocab.js:78:18
       console.log(e);
       res.json({
         success: false,
-        message: "something went wrong when get data from getVocabinLesson",
+        message: "",
       });
       return [];
killedBy: getVocabinLesson should return an alert error if an error occurs
statusReason: Error: listen EADDRINUSE: address already in use :::3000

[NoCoverage] BlockStatement
controllers/Vocab.js:84:40
     }
 
  }
- const setAlarmVocab = async(req,res)=>{
-    const myCollection = collection(firestore, 'Users');
-    const docRef1 = doc(myCollection, req.params.userId);
-    try {
-      const docRef = await setDoc(docRef1, req.body );
-      console.log("Document written ");
-      res.send({ message: 'Data saved successfully' });
-    } catch (error) {
-      console.error("Error adding document: ", error);
-    }
- }
+ const setAlarmVocab = async(req,res)=>{}
 
  const getAlarmVocab = async (req,res)=>{

[NoCoverage] BlockStatement
controllers/Vocab.js:87:9
  const setAlarmVocab = async(req,res)=>{
     const myCollection = collection(firestore, 'Users');
     const docRef1 = doc(myCollection, req.params.userId);
-    try {
-      const docRef = await setDoc(docRef1, req.body );
-      console.log("Document written ");
-      res.send({ message: 'Data saved successfully' });
-    } catch (error) {
+    try {} catch (error) {
       console.error("Error adding document: ", error);
     }

[NoCoverage] BlockStatement
controllers/Vocab.js:91:21
       const docRef = await setDoc(docRef1, req.body );
       console.log("Document written ");
       res.send({ message: 'Data saved successfully' });
-    } catch (error) {
-      console.error("Error adding document: ", error);
-    }
+    } catch (error) {}
  }
 

[NoCoverage] BlockStatement
controllers/Vocab.js:96:41
     }
  }
 
- const getAlarmVocab = async (req,res)=>{
-    const myCollection = collection(firestore, 'Users');
-    const docRef = doc(myCollection, req.params.userId);
-    try{
-    const documentSnapshot = await getDoc(docRef);
-  
-  if (documentSnapshot.exists()) {
-    const data = documentSnapshot.data().vocabAlarms || [];
-    res.json({success:true, vocabAlarm:data});
-  } else {
-    console.log('Document does not exist.');
-    res.json({success:true, vocabAlarm:'-1'});
-  }
-    }
-    catch(e){
-        res.json({
-            success:false,
-            message:'something went wrong when get data from vocabAlarm'
-        })
-        console.log(e)
-    }
-}
+ const getAlarmVocab = async (req,res)=>{}
 const updateAlarmVocab = async(req,res)=>{
     const myCollection = collection(firestore, 'Users');

[NoCoverage] BlockStatement
controllers/Vocab.js:99:8
  const getAlarmVocab = async (req,res)=>{
     const myCollection = collection(firestore, 'Users');
     const docRef = doc(myCollection, req.params.userId);
-    try{
-    const documentSnapshot = await getDoc(docRef);
-  
-  if (documentSnapshot.exists()) {
-    const data = documentSnapshot.data().vocabAlarms || [];
-    res.json({success:true, vocabAlarm:data});
-  } else {
-    console.log('Document does not exist.');
-    res.json({success:true, vocabAlarm:'-1'});
-  }
-    }
+    try{}
     catch(e){
         res.json({

[NoCoverage] BlockStatement
controllers/Vocab.js:102:34
     try{
     const documentSnapshot = await getDoc(docRef);
   
-  if (documentSnapshot.exists()) {
-    const data = documentSnapshot.data().vocabAlarms || [];
-    res.json({success:true, vocabAlarm:data});
-  } else {
+  if (documentSnapshot.exists()) {} else {
     console.log('Document does not exist.');
     res.json({success:true, vocabAlarm:'-1'});

[NoCoverage] LogicalOperator
controllers/Vocab.js:103:18
     const documentSnapshot = await getDoc(docRef);
   
   if (documentSnapshot.exists()) {
-    const data = documentSnapshot.data().vocabAlarms || [];
+    const data = documentSnapshot.data().vocabAlarms && [];
     res.json({success:true, vocabAlarm:data});
   } else {

[NoCoverage] ConditionalExpression
controllers/Vocab.js:103:18
     const documentSnapshot = await getDoc(docRef);
   
   if (documentSnapshot.exists()) {
-    const data = documentSnapshot.data().vocabAlarms || [];
+    const data = false;
     res.json({success:true, vocabAlarm:data});
   } else {

[NoCoverage] BooleanLiteral
controllers/Vocab.js:104:23
   
   if (documentSnapshot.exists()) {
     const data = documentSnapshot.data().vocabAlarms || [];
-    res.json({success:true, vocabAlarm:data});
+    res.json({success:false, vocabAlarm:data});
   } else {
     console.log('Document does not exist.');

[NoCoverage] BlockStatement
controllers/Vocab.js:105:10
   if (documentSnapshot.exists()) {
     const data = documentSnapshot.data().vocabAlarms || [];
     res.json({success:true, vocabAlarm:data});
-  } else {
-    console.log('Document does not exist.');
-    res.json({success:true, vocabAlarm:'-1'});
-  }
+  } else {}
     }
     catch(e){

[NoCoverage] StringLiteral
controllers/Vocab.js:106:17
     const data = documentSnapshot.data().vocabAlarms || [];
     res.json({success:true, vocabAlarm:data});
   } else {
-    console.log('Document does not exist.');
+    console.log("");
     res.json({success:true, vocabAlarm:'-1'});
   }

[NoCoverage] BooleanLiteral
controllers/Vocab.js:107:23
     res.json({success:true, vocabAlarm:data});
   } else {
     console.log('Document does not exist.');
-    res.json({success:true, vocabAlarm:'-1'});
+    res.json({success:false, vocabAlarm:'-1'});
   }
     }

[NoCoverage] ObjectLiteral
controllers/Vocab.js:107:14
     res.json({success:true, vocabAlarm:data});
   } else {
     console.log('Document does not exist.');
-    res.json({success:true, vocabAlarm:'-1'});
+    res.json({});
   }
     }

[NoCoverage] BlockStatement
controllers/Vocab.js:110:13
     res.json({success:true, vocabAlarm:'-1'});
   }
     }
-    catch(e){
-        res.json({
-            success:false,
-            message:'something went wrong when get data from vocabAlarm'
-        })
-        console.log(e)
-    }
+    catch(e){}
 }
 const updateAlarmVocab = async(req,res)=>{

[NoCoverage] ObjectLiteral
controllers/Vocab.js:111:18
   }
     }
     catch(e){
-        res.json({
-            success:false,
-            message:'something went wrong when get data from vocabAlarm'
-        })
+        res.json({})
         console.log(e)
     }

[NoCoverage] StringLiteral
controllers/Vocab.js:113:21
     catch(e){
         res.json({
             success:false,
-            message:'something went wrong when get data from vocabAlarm'
+            message:""
         })
         console.log(e)

[NoCoverage] BlockStatement
controllers/Vocab.js:118:42
         console.log(e)
     }
 }
-const updateAlarmVocab = async(req,res)=>{
-    const myCollection = collection(firestore, 'Users');
-    const docRef = doc(myCollection, req.params.userId);
-    try {
-        await updateDoc(docRef, req.body);
-        console.log('Document successfully updated!');
-        res.send({ message: 'Document successfully updated!' });
-      } catch (error) {
-        console.error('Error updating document: ', error);
-      }
-}
+const updateAlarmVocab = async(req,res)=>{}
 module.exports={getVocabLesson, getVocabinLesson, getVocabs, setAlarmVocab, getAlarmVocab, updateAlarmVocab}

[NoCoverage] StringLiteral
controllers/Vocab.js:119:48
     }
 }
 const updateAlarmVocab = async(req,res)=>{
-    const myCollection = collection(firestore, 'Users');
+    const myCollection = collection(firestore, "");
     const docRef = doc(myCollection, req.params.userId);
     try {

[NoCoverage] BlockStatement
controllers/Vocab.js:121:9
 const updateAlarmVocab = async(req,res)=>{
     const myCollection = collection(firestore, 'Users');
     const docRef = doc(myCollection, req.params.userId);
-    try {
-        await updateDoc(docRef, req.body);
-        console.log('Document successfully updated!');
-        res.send({ message: 'Document successfully updated!' });
-      } catch (error) {
+    try {} catch (error) {
         console.error('Error updating document: ', error);
       }

[NoCoverage] StringLiteral
controllers/Vocab.js:124:29
     try {
         await updateDoc(docRef, req.body);
         console.log('Document successfully updated!');
-        res.send({ message: 'Document successfully updated!' });
+        res.send({ message: "" });
       } catch (error) {
         console.error('Error updating document: ', error);

[NoCoverage] BlockStatement
controllers/Vocab.js:125:23
         await updateDoc(docRef, req.body);
         console.log('Document successfully updated!');
         res.send({ message: 'Document successfully updated!' });
-      } catch (error) {
-        console.error('Error updating document: ', error);
-      }
+      } catch (error) {}
 }
 module.exports={getVocabLesson, getVocabinLesson, getVocabs, setAlarmVocab, getAlarmVocab, updateAlarmVocab}
