[Killed] ObjectLiteral
controllers/User.js:100:28
       res.send({ message: 'User data set successfully' });
     } catch (error) {
       console.error("Error setting user document: ", error);
-      res.status(500).json({ success: false, message: 'something went wrong when set user data'});
+      res.status(500).json({});
     }
   };
killedBy: setUserInfo should handle error when adding document
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "something went wrong when set user data",
-   "success": false,

[Killed] StringLiteral
controllers/User.js:113:55
       res.send({ message: 'Document successfully updated!' });
     } catch (error) {
       console.error("Error updating user document: ", error);
-      res.status(500).json({ success: false, message: 'something went wrong when update user data' });
+      res.status(500).json({ success: false, message: "" });
     }
   };
killedBy: updateUser should handle error when adding document
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "something went wrong when update user data",
+   "message": "",

[Killed] StringLiteral
controllers/User.js:130:55
       }
     } catch (error) {
       console.error("Error get user document: ", error);
-      res.status(500).json({ success: false, message: 'something went wrong when get data from users' });
+      res.status(500).json({ success: false, message: "" });
     }
   };
killedBy: getUserData should return an error message on failure
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "something went wrong when get data from users"
Received: ""

[Killed] ObjectLiteral
controllers/User.js:144:18
     res.json({success:true, users:list});
     }
     catch(error){
-        res.json({success:false, message: 'something went wrong when get data from Users'})
+        res.json({})
         console.log(error);
         return [];
killedBy: getAllUsers should return an alert error if an error occurs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined
