[Killed] BlockStatement
controllers/PracticePlan.js:133:40
         const docRef1 = doc(myCollection, req.params.userId);
         const documentSnapshot = await getDoc(docRef1);
   
-        if (documentSnapshot.exists()) {
-          res.send({ success: true, PracticePlan: documentSnapshot.data() });
-        } else {
+        if (documentSnapshot.exists()) {} else {
           res.status(404).send({ success: false, message: 'Practice plan not found' });
         }
killedBy: getPracticePlan should return practice plan when document exists
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."
